lab11_php_ci/ci4/app/Controllers/Artikel.php

public function index()
{
    $title = 'Daftar Artikel';
$model = new ArtikelModel();
$artikel = $model->findAll();
---
SELECT *
FROM `artikel`

public function view($slug)
{
$model = new ArtikelModel();
$artikel = $model->where([
'slug' => $slug
])->first();
---
SELECT *
FROM `artikel`
WHERE `slug` = 'artikel-pertama'
 LIMIT 1

public function admin_index()
{
$title = 'Daftar Artikel';
$model = new ArtikelModel();
$artikel = $model->findAll();
---
SELECT *
FROM `artikel`

public function edit($id)
{
$artikel = new ArtikelModel();
// validasi data.
$validation = \Config\Services::validation();
$validation->setRules(['judul' => 'required']);
$isDataValid = $validation->withRequest($this->request)->run();
if ($isDataValid)
{
$artikel->update($id, [
'judul' => $this->request->getPost('judul'),
'isi' => $this->request->getPost('isi'),
]);
return redirect('admin/artikel');
}
// ambil data lama
$data = $artikel->where('id', $id)->first();
---
SELECT *
FROM `artikel`
WHERE `id` = '1'
 LIMIT 1